Revit 2024 API
BuiltInFailures.ElectricalFailures.MismatchPoleBrakesSlotsNumbers Property
 The number of pole breakers may not be less than the number of occupied slots.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MismatchPoleBrakesSlotsNumbers { get; }
Visual Basic
Public Shared ReadOnly Property MismatchPoleBrakesSlotsNumbers As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MismatchPoleBrakesSlotsNumbers {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace